{"cid": "Ugzcjz3tx85bbEIFTbV4AaABAg", "text": "I had an uncle passed away years ago, and he was a practical joker through and through. His final practical joke was at his own funeral. The funeral starts everyone seated, but there’s nothing upfront. This is pretty unusual normally that’s where the bodies at. After they finish the first song it’s very quiet in this church that can see 700 people. Mind you there’s only 100 people at his funeral. All the sudden his best friend from Vietnam starts, wheeling him up the aisle with the squeak wheel you’ve ever heard. And it is a long way to the front and is not moving very fast. My aunt who had just lost the love of her life was a first one to break down and start laughing on controllably at the sheer ridiculousness of this joke. I’m not saying every funeral is funny, but sometimes funny shit happens at the most inappropriate time and some funny shit happens because the Vietnam veteran coped with his own PTSD through humor chooses to be remembered through that exact coping mechanism. So for God sakes people laugh at the sheer absurdity of this beautiful creation.", "time": "10 months ago", "author": "@jackjumper4231", "channel": "UCEWy_yP87QDVaSA65OwQ5cA", "votes": "2", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_lZxp74Ed6w38LcaoyFqNYQjWAwviKqik-NVn_BR9E=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1743716130.073336}
{"cid": "Ugz7d9JSEgtiJ_pyIZx4AaABAg", "text": "😂😂😂😂😂😂😂", "time": "10 months ago", "author": "@mariafildan5059", "channel": "UCnnhXa4GRMMvBdE1yno2kYw", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_mmc6FNd0MiIszwkWU-_6fg1WSIKTsRc6P3E4hvDt0eXv4=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1743716130.07504}
{"cid": "Ugzj_UrAVfWDX0ij8sp4AaABAg", "text": "Ong ha ha", "time": "10 months ago", "author": "@leahw88888", "channel": "UCfKKEy4bOEKTzey3XK9btqQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_mdl4rzcexFVv7CJq3f64dqXlPMCVORo2rywsGcfhc=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1743716130.075931}
