{"cid": "UgzaNMr7liFfkeWxHU54AaABAg", "text": "Yes I agree", "time": "7 months ago", "author": "@VidaGabri", "channel": "UCiPDLR-ymjb7chUhJcLyNUA", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/eW-q1vDJ6QXtIFbNWJYvAWUUxs-dZMuHqC-LB9_yNay_-HEB0qtnqnODzJuzTBRnZgVwVAxJEjQ=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1753079351.537881}
{"cid": "Ugyx4pKnmL_1SSZnC6Z4AaABAg", "text": "Real.", "time": "7 months ago", "author": "@eliciasutton2904", "channel": "UC_sobMoLCO9abpiOqSH9ALg", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/PZ1rSjbQcaBlsJ8Oieomf3RV8qJIrk8hRxjHiOc6iSFWXNA8haMVrDPWrvhEcPsEXE4Z5VtqnQ=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1753079351.540589}
{"cid": "Ugz9ovyXtdo4eP7_S8d4AaABAg", "text": "Amen right?", "time": "7 months ago", "author": "@JenniferWinchell-oh7wv", "channel": "UCJXh5JDLdHVTmCAyHJvBlDQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/wfs7Y068qlZMs0hT_j1qOG1jZQCqIdN1alTrC2-7TvXyNiF3xrWeMVRZMQbUmnTLgCblRZNGkZQ=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1753079351.541964}
{"cid": "UgzFgdTJ34olFO__-114AaABAg", "text": "God is THE BEST BEST counselor I have ever went to and more people should go to his counseling sessions ❤", "time": "7 months ago", "author": "@GenevaMartin-c4o", "channel": "UCv5Owyz3CIQM4TqsuWofa1Q", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/rZL91uy2XdISEtYjHlvvn3KWWx5j-iYNbbJFxo3e4vshZoUbBt2yymmgSQ6UpeMOe_hYrmUsgA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1753079351.543328}
{"cid": "UgxuzJ9Q3XQsNWXUbBl4AaABAg", "text": "Amen 😊😊😊😊", "time": "7 months ago", "author": "@GunwanteeMisit", "channel": "UCv2HmoKVyYy0bQfZHKpYhfQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/VMBFsTUYO57cC3B360vWUzAcEXzkP5QI0BjprmqZXmCemMesCzJLUvIvUMpxV8bCXvJv40iyLsI=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1753079351.544718}
{"cid": "UgzFFZ2HwsBGyayQCJ54AaABAg", "text": "God is good!", "time": "7 months ago", "author": "@IsaacKuhls", "channel": "UCrXEa4kRqmwnx_e3vPmxLZA", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_lsIO0KH93OMfL3PN3kkxTUk7TsNceOYa6t219yVP8ios1EvW8tDuW7p3U0VVLxkXJlUA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1753079351.546253}
{"cid": "UgxzgVU3yeErY9LpB194AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 13\r\nFor it is written\r\nRevelation 1:17\r\n17 When I saw him, I fell at his feet as though dead. Then he placed his right hand on me and said: “Do not be afraid. I am the First and the Last.\r\n\r\nRevelation 2:10\r\n10 Do not be afraid of what you are about to suffer. I tell you, the devil will put some of you in prison to test you, and you will suffer persecution for ten days. Be faithful, even to the point of death, and I will give you life as your victor’s crown.\r\n\r\nNehemiah 9:27\r\n27 So you delivered them into the hands of their enemies, who oppressed them. But when they were oppressed they cried out to you. From heaven you heard them, and in your great compassion you gave them deliverers, who rescued them from the hand of their enemies.\r\n\r\nMatthew 5:44\r\n44 But I tell you, love your enemies and pray for those who persecute you,\r\n\r\nProverbs 16:7\r\n7 When the LORD takes pleasure in anyone’s way, he causes their enemies to make peace with them.\r\n\r\nLeviticus 26:7\r\n7 You will pursue your enemies, and they will fall by the sword before you.\r\n\r\n2 Samuel 22:41\r\n41 You made my enemies turn their backs in flight, and I destroyed my foes.\r\n\r\nIsaiah 41:12\r\n12 Though you search for your enemies, \r\nyou will not find them. Those who wage war against you will be as nothing at all.\r\n\r\nNahum 1:2\r\n2 The LORD is a jealous and avenging God; the LORD takes vengeance and is filled with wrath. The LORD takes vengeance on his foes and vents his wrath against his enemies.\r\n\r\nJob 8:22\r\n22 Your enemies will be clothed in shame, and the tents of the wicked will be no more.”\r\n\r\n2 Samuel 22:4\r\n4 “I called to the LORD, who is worthy of praise, and have been saved from my enemies.\r\n\r\n2 Kings 17:39\r\n39 Rather, worship the LORD your God; it is he who will deliver you from the hand of all your enemies.”\r\n\r\n2 Kings 21:14\r\n14 I will forsake the remnant of my inheritance and give them into the hands of enemies. They will be looted and plundered by all their enemies;\r\n\r\nJoshua 10:25\r\n25 Joshua said to them, “Do not be afraid; do not be discouraged. Be strong and courageous. This is what the LORD will do to all the enemies you are going to fight.”\r\n\r\nJoshua 21:44\r\n44 The LORD gave them rest on every side, just as he had sworn to their ancestors. Not one of their enemies withstood them; the LORD gave all their enemies into their hands.\r\n\r\nLuke 6:27\r\n27 “But to you who are listening I say: Love your enemies, do good to those who hate you,\r\n\r\nLuke 6:35\r\n35 But love your enemies, do good to them, and lend to them without expecting to get anything back. Then your reward will be great, and you will be children of the Most High, because he is kind to the ungrateful and wicked.\r\n\r\nPsalms 9:3\r\n3 My enemies turn back; they stumble and perish before you.\r\n\r\nPsalms 18:3\r\n3 I called to the LORD, who is worthy of praise, and I have been saved from my enemies.\r\n\r\nPsalms 92:9\r\n9 For surely your enemies, LORD, surely your enemies will perish; all evildoers will be scattered.\r\n\r\nPsalms 18:40\r\n40 You made my enemies turn their backs in flight, and I destroyed my foes.\r\n\r\nPsalms 30:1\r\n1 I will exalt you, LORD, for you lifted me out of the depths and did not let my enemies gloat over me.\r\n\r\nPsalms 44:7\r\n7 but you give us victory over our enemies, you put our adversaries to shame.\r\n\r\nPsalms 21:8\r\n8 Your hand will lay hold on all your enemies; your right hand will seize your foes.\r\n\r\nPsalms 56:1\r\n1 Be merciful to me, my God, for my enemies are in hot pursuit; all day long they press their attack.\r\n\r\nPsalms 56:9\r\n9 Then my enemies will turn back when I call for help. By this I will know that God is for me.\r\n\r\nPsalms 5:8\r\n8 Lead me, LORD, in your righteousness because of my enemies— make your way straight before me.", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.547718}
{"cid": "UgynZEL81jZvV0ZsTax4AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 14\r\nFor it is written\r\nPsalms 59:1\r\n1 Deliver me from my enemies, O God; be my fortress against those who are attacking me.\r\n\r\nPsalm 60\r\n11Give us aid against the enemy, for human help is worthless.\r\n12With God we will gain the victory, and he will trample down our enemies.\r\n\r\nPsalm 63\r\n7Because you are my help,\r\nI sing in the shadow of your wings.\r\n8I cling to you;\r\nyour right hand upholds me.\r\n\r\nPsalms 66:3\r\n3 Say to God, “How awesome are your deeds! So great is your power that your enemies cringe before you.\r\n\r\nPsalms 68:1\r\n1 May God arise, may his enemies be scattered; may his foes flee before him. \r\n\r\nPsalms 108:13\r\n13 With God we will gain the victory, and he will trample down our enemies.\r\n\r\n12Give us aid against the enemy, for human help is worthless.\r\n13With God we will gain the victory, and he will trample down our enemies.\r\n\r\nPsalms 118:7\r\n7 The LORD is with me; he is my helper. I look in triumph on my enemies.\r\n\r\nPsalms 119:98\r\n98 Your commands are always with me and make me wiser than my enemies.\r\n\r\nPsalms 136:24\r\n24 and freed us from our enemies. His love endures forever.\r\n\r\nPsalms 143:9\r\n9 Rescue me from my enemies, LORD, for I hide myself in you.\r\n\r\nPsalms 143:12\r\n12 In your unfailing love, silence my enemies; destroy all my foes, for I am your servant.\r\n\r\nDeuteronomy 12:10\r\n10 But you will cross the Jordan and settle in the land the LORD your God is giving you as an inheritance, and he will give you rest from all your enemies around you so that you will live in safety.\r\n\r\nDeuteronomy 20:1\r\n1 When you go to war against your enemies and see horses and chariots and an army greater than yours, do not be afraid of them, because the LORD your God, who brought you up out of Egypt, will be with you.\r\n\r\nDeuteronomy 20:4\r\n4 For the LORD your God is the one who goes with you to fight for you against your enemies to give you victory.”\r\n\r\nDeuteronomy 28:7\r\n 7 The LORD will grant that the enemies who rise up against you will be defeated before you. They will come at you from one direction but flee from you in seven.\r\n\r\nDeuteronomy 30:7\r\n7 The LORD your God will put all these curses on your enemies who hate and persecute you.\r\n\r\nDeuteronomy 33:27\r\n27 The eternal God is your refuge, and underneath are the everlasting arms. He will drive out your enemies before you, saying, ‘Destroy them!’\r\n\r\nIsaiah 41:10\r\n10 So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.\r\n\r\nIsaiah 41:14\r\n14 Do not be afraid, you worm Jacob, little Israel, do not fear, for I myself will help you,” declares the LORD, your Redeemer, the Holy One of Israel.\r\n\r\n2 Timothy 1:14\r\n14 Guard the good deposit that was entrusted to you—guard it with the help of the Holy Spirit who lives in us.\r\n\r\n2 Samuel 22:36\r\n36 You make your saving help my shield; your help has made me great.\r\n\r\nPsalms 5:2\r\n2 Hear my cry for help, my King and my God, for to you I pray.\r\n\r\nPsalms 12:1\r\n1 Help, LORD, for no one is faithful anymore; those who are loyal have vanished from the human race.\r\n\r\nPsalms 18:29\r\n29 With your help I can advance against a troop ; with my God I can scale a wall.\r\n\r\nPsalms 18:35\r\n35 You make your saving help my shield, and your right hand sustains me; your help has made me great.\r\n\r\nPsalms 22:19\r\n19 But you, LORD, do not be far from me. You are my strength; come quickly to help me.\r\n\r\nPsalms 28:2\r\n2 Hear my cry for mercy as I call to you for help, as I lift up my hands toward your Most Holy Place.\r\n\r\nPsalm 28\r\n6Praise be to the Lord, for he has heard my cry for mercy.\r\n7The Lord is my strength and my shield; my heart trusts in him, and he helps me.", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.549207}
{"cid": "Ugwl9LOwPH145LCdJ9d4AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 15\r\nFor it is written\r\nPsalm 30\r\n2 Lord my God, I called to you for help,\r\nand you healed me.\r\n\r\n10Hear, Lord, and be merciful to me;\r\nLord, be my help.”\r\n\r\nPsalms 30:2\r\n2 LORD my God, I called to you for help, and you healed me.\r\n\r\nPsalms 33:20\r\n20 We wait in hope for the LORD; he is our help and our shield.\r\n\r\nPsalm 37\r\n40The Lord helps them and delivers them;\r\nhe delivers them from the wicked and saves them,\r\nbecause they take refuge in him.\r\n\r\nPsalms 38:22\r\n22 Come quickly to help me, my Lord and my Savior.\r\n\r\nPsalms 39:12\r\n12 “Hear my prayer, LORD, listen to my cry for help; do not be deaf to my weeping. I dwell with you as a foreigner, a stranger, as all my ancestors were.\r\n\r\nPsalms 40:16\r\n16 But may all who seek you rejoice and be glad in you; may those who long for your saving help always say, “The LORD is great!”\r\n\r\nPsalms 40:13\r\n13 Be pleased to save me, LORD; come quickly, LORD, to help me.\r\n\r\nPsalms 44:26\r\n26 Rise up and help us; rescue us because of your unfailing love.\r\n\r\nPsalms 46:1\r\n1 God is our refuge and strength, an ever-present help in trouble.\r\n\r\nPsalms 46:5\r\n5 God is within her, she will not fall; God will help her at break of day.\r\n\r\nPsalms 60:5\r\n5 Save us and help us with your right hand, that those you love may be delivered.\r\n\r\nPsalms 54:4\r\n4 Surely God is my help; the Lord is the one who sustains me.\r\n\r\nPsalm 55\r\n16As for me, I call to God, and the Lord saves me.\r\n\r\n18He rescues me unharmed from the battle waged against me, even though many oppose me.\r\n\r\nPsalms 56:9\r\n9 Then my enemies will turn back when I call for help. By this I will know that God is for me.\r\n\r\nPsalms 59:4\r\n4 I have done no wrong, yet they are ready to attack me. Arise to help me; look on my plight!\r\n\r\nPsalms 60:11\r\n11 Give us aid against the enemy, for human help is worthless.\r\n\r\nPsalms 69\r\n29But as for me, afflicted and in pain—\r\nmay your salvation, God, protect me.\r\n\r\nPsalms 63:7\r\n7 Because you are my help, I sing in the shadow of your wings.\r\n\r\nPsalms 70:1\r\n1 Hasten, O God, to save me; come quickly, LORD, to help me.\r\n\r\n4But may all who seek you\r\nrejoice and be glad in you;\r\nmay those who long for your saving help always say,\r\n“The Lord is great!”\r\n5But as for me, I am poor and needy;\r\ncome quickly to me, O God.\r\nYou are my help and my deliverer;\r\nLord, do not delay.\r\n\r\nPsalms 70:4\r\n4 But may all who seek you rejoice and be glad in you; may those who long for your saving help always say, “The LORD is great!”\r\n\r\nPsalms 70:5\r\n5 But as for me, I am poor and needy; come quickly to me, O God. You are my help and my deliverer; LORD, do not delay.\r\n\r\nPsalms 71:12\r\n12 Do not be far from me, my God; come quickly, God, to help me.\r\n\r\nPsalms 72\r\n14He will rescue them from oppression and violence,\r\nfor precious is their blood in his sight.\r\n\r\nPsalms 77:1\r\n1 I cried out to God for help; I cried out to God to hear me.\r\n\r\nPsalms 72:12\r\n12 For he will deliver the needy who cry out, the afflicted who have no one to help.\r\n\r\nPsalms 79:9\r\n9 Help us, God our Savior, for the glory of your name; deliver us and forgive our sins for your name’s sake.\r\n\r\nPsalm 86\r\n17Give me a sign of your goodness,\r\nthat my enemies may see it and be put to shame,\r\nfor you, Lord, have helped me and comforted me.\r\n\r\nPsalms 88:13\r\n13 But I cry to you for help, LORD; in the morning my prayer comes before you.\r\n\r\nPsalms 94:17\r\n17 Unless the LORD had given me help, I would soon have dwelt in the silence of death.\r\n\r\nPsalms 102:1\r\n1 Hear my prayer, LORD; let my cry for help come to you.\r\n\r\nPsalms 108:6\r\n6 Save us and help us with your right hand, that those you love may be delivered.\r\n\r\nPsalms 108:12\r\n12 Give us aid against the enemy, for human help is worthless.\r\n\r\nPsalms 109:21\r\n21 But you, Sovereign LORD, help me for your name’s sake; out of the goodness of your love, deliver me.\r\n\r\nPsalms 109:26\r\n26 Help me, LORD my God; save me according to your unfailing love.\r\n\r\nPsalms 115:9\r\n9 All you Israelites, trust in the LORD— he is their help and shield.\r\n10 House of Aaron, trust in the LORD— he is their help and shield.\r\n\r\nPsalms 115\r\n9All you Israelites, trust in the Lord—\r\nhe is their help and shield.\r\n\r\n11 You who fear him, trust in the LORD— he is their help and shield.\r\n\r\nPsalm 118\r\n7The Lord is with me; he is my helper.\r\nI look in triumph on my enemies.\r\n\r\n13I was pushed back and about to fall,\r\nbut the Lord helped me.\r\n\r\nPsalms 119:147\r\n147 I rise before dawn and cry for help; I have put my hope in your word.\r\n\r\nPsalms 121:2\r\n2 My help comes from the LORD, the Maker of heaven and earth.\r\n\r\nPsalm 124\r\n6Praise be to the Lord,\r\nwho has not let us be torn by their teeth.\r\n7We have escaped like a bird\r\nfrom the fowler’s snare;\r\nthe snare has been broken,\r\n8Our help is in the name of the Lord,\r\nthe Maker of heaven and earth.\r\n\r\nPsalms 146:5\r\n5 Blessed are those whose help is the God of Jacob, whose hope is in the LORD their God.\r\n\r\nJohn 14:16\r\n16 And I will ask the Father, and he will give you another advocate to help you and be with you forever—\r\n \r\nMark 14:7\r\n7 The poor you will always have with you, and you can help them any time you want. But you will not always have me.\r\n\r\nIsaiah 41:13\r\n13 For I am the LORD your God who takes hold of your right hand and says to you, Do not fear; I will help you.\r\n\r\nDeuteronomy 33:26\r\n26 “There is no one like the God of Jeshurun, who rides across the heavens to help you and on the clouds in his majesty.\r\n\r\nLuke 7:16\r\n16 They were all filled with awe and praised God. “A great prophet has appeared among us,” they said. “God has come to help his people.”\r\n\r\nHebrews 2:18\r\n 18 Because he himself suffered when he was tempted, he is able to help those who are being tempted.\r\n\r\nHebrews 4:16\r\n16 Let us then approach God’s throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need.\r\n\r\nHebrews 6:10\r\n10 God is not unjust; he will not forget your work and the love you have shown him as you have helped his people and continue to help them.\r\n\r\nExodus 4:12\r\n12 Now go; I will help you speak and will teach you what to say.”\r\n\r\nGenesis 31:6\r\n6 You know that I’ve worked for your father with all my strength,\r\n\r\nGenesis 31:6\r\n6 You know that I’ve worked for your father with all my strength\r\n\r\nGenesis 48:2\r\n2 When Jacob was told, “Your son Joseph has come to you,” Israel rallied his strength and sat up on the bed.\r\n\r\nGenesis 49:3\r\n3 “Reuben, you are my firstborn, my might, the first sign of my strength, excelling in honor, excelling in power.\r\n\r\nHosea 7:9\r\n9 Foreigners sap his strength, but he does not realize it. His hair is sprinkled with gray, but he does not notice.\r\n\r\nHosea 10:13\r\n13 But you have planted wickedness, you have reaped evil, you have eaten the fruit of deception. Because you have depended on your own strength and on your many warriors,\r\n\r\nHabakkuk 1:11\r\n11 Then they sweep past like the wind and go on— guilty people, whose own strength is their god.”\r\n\r\nHabakkuk 3:19\r\n19 The Sovereign LORD is my strength; he makes my feet like the feet of a deer, he enables me to tread on the heights.\r\n\r\nMark 12:30\r\n30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.550768}
{"cid": "UgwFuIcTQQPyvUh2bY14AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 16\r\nFor it is written\r\nMark 12:33\r\n33 To love him with all your heart, with all your understanding and with all your strength, and to love your neighbor as yourself is more important than all burnt offerings and sacrifices.”\r\n\r\nActs 9:19\r\n19 and after taking some food, he regained his strength. Saul spent several days with the disciples in Damascus.\r\n\r\nAmos 2:14\r\n14 The swift will not escape, the strong will not muster their strength, and the warrior will not save his life.\r\n\r\nAmos 6:13\r\n13 you who rejoice in the conquest of Lo Debarand say, “Did we not take Karnaim by our own strength?”\r\n\r\nNahum 2:1\r\n1 An attacker advances against you, Nineveh. Guard the fortress, watch the road, brace yourselves, marshal all your strength!\r\n\r\nNahum 3:9\r\n9 Cush and Egypt were her boundless strength; Put and Libya were among her allies.\r\n\r\nNumbers 14:17\r\n17 “Now may the Lord’s strength be displayed, just as you have declared:\r\n\r\nNumbers 23:22\r\n22 God brought them out of Egypt; they have the strength of a wild ox.\r\n\r\nNumbers 24:8\r\n8 “God brought them out of Egypt; they have the strength of a wild ox. They devour hostile nations and break their bones in pieces; with their arrows they pierce them.\r\n\r\n1 Corinthians 1:25\r\n25 For the foolishness of God is wiser than human wisdom, and the weakness of God is stronger than human strength.\r\n\r\n1 Chronicles 16:11\r\n11 Look to the LORD and his strength; seek his face always.\r\n,\r\n1 Chronicles 16:27\r\n27 Splendor and majesty are before him; strength and joy are in his dwelling place.\r\n28 Ascribe to the LORD, all you families of nations, ascribe to the LORD glory and strength.\r\n\r\n1 Chronicles 26:8\r\n8 All these were descendants of Obed-Edom; they and their sons and their relatives were capable men with the strength to do the work—descendants of Obed-Edom, 62 in all.\r\n\r\n1 Chronicles 29:12\r\n12 Wealth and honor come from you; you are the ruler of all things. In your hands are strength and power to exalt and give strength to all.\r\n\r\n2 Chronicles 13:21\r\n21 But Abijah grew in strength. He married fourteen wives and had twenty-two sons and sixteen daughters.\r\n\r\n2 Chronicles 23:1\r\n1 In the seventh year Jehoiada showed his strength. He made a covenant with the commanders of units of a hundred: Azariah son of Jeroham, Ishmael son of Jehohanan, Azariah son of Obed, Maaseiah son of Adaiah, and Elishaphat son of Zikri.\r\n\r\n2 Chronicles 25:11\r\n11 Amaziah then marshaled his strength and led his army to the Valley of Salt, where he killed ten thousand men of Seir.\r\n\r\nPsalms 10:10\r\n10 His victims are crushed, they collapse; they fall under his strength.\r\n\r\nPsalms 18:1\r\n1 I love you, LORD, my strength.\r\n\r\nPsalms 18:32\r\n32 It is God who arms me with strength and keeps my way secure.\r\n\r\nPsalms 18:39\r\n39 You armed me with strength for battle; you humbled my adversaries before me.\r\n\r\nPsalms 21:1\r\n1 The king rejoices in your strength, LORD. How great is his joy in the victories you give!\r\n\r\nPsalms 21:13\r\n13 Be exalted in your strength, LORD; we will sing and praise your might.\r\n\r\nPsalms 22:19\r\n19 But you, LORD, do not be far from me. You are my strength; come quickly to help me.\r\n\r\nPsalms 28:7\r\n6Praise be to the Lord, for he has heard my cry for mercy.\r\n7 The LORD is my strength and my shield; my heart trusts in him, and he helps me. My heart leaps for joy, and with my song I praise him.\r\n8 The LORD is the strength of his people, a fortress of salvation for his anointed one.\r\n\r\nPsalms 29:1\r\n1 Ascribe to the LORD, you heavenly beings, ascribe to the LORD glory and strength.\r\n\r\nPsalms 29:11\r\n11 The LORD gives strength to his people; the LORD blesses his people with peace.\r\n\r\nPsalms 31:10\r\n10 My life is consumed by anguish and my years by groaning; my strength fails because of my affliction, and my bones grow weak.\r\n\r\nPsalms 32:4\r\n4 For day and night your hand was heavy on me; my strength was sapped as in the heat of summer.\r\n\r\nPsalms 33:16\r\n16 No king is saved by the size of his army; no warrior escapes by his great strength.\r\n\r\nPsalms 33:17\r\n17 A horse is a vain hope for deliverance; despite all its great strength it cannot save.\r\n\r\nPsalms 38:10\r\n10 My heart pounds, my strength fails me; even the light has gone from my eyes.\r\n\r\nPsalms 46:1\r\n1 God is our refuge and strength, an ever-present help in trouble.\r\n\r\nPsalm 59\r\n9You are my strength, I watch for you; you, God, are my fortress,\r\n10my God on whom I can rely. God will go before me and will let me gloat over those who slander me.\r\n11But do not kill them, Lord our shield, or my people will forget.\r\nIn your might uproot them and bring them down.\r\n\r\nPsalms 59:16\r\n16 But I will sing of your strength, in the morning I will sing of your love; for you are my fortress, my refuge in times of trouble.\r\n17 You are my strength, I sing praise to you; you, God, are my fortress, my God on whom I can rely.\r\n\r\nPsalms 65:6\r\n6 who formed the mountains by your power, having armed yourself with \r\nstrength,\r\n\r\nPsalms 68:28\r\n28 Summon your power, God ; show us your strength, our God, as you have done before.\r\n\r\nPsalms 68:35\r\n35 You, God, are awesome in your sanctuary; the God of Israel gives power and strength to his people. Praise be to God!\r\n\r\nPsalms 71:9\r\n9 Do not cast me away when I am old; do not forsake me when my strength is gone.\r\n\r\nPsalms 73:26\r\n26 My flesh and my heart may fail, but God is the strength of my heart and my portion forever.", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.552395}
{"cid": "Ugze2uuwM5J9hGi43aN4AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 17\r\nFor it is written\r\nPsalm 79\r\n9Help us, God our Savior, for the glory of your name;\r\ndeliver us and forgive our sins for your name’s sake.\r\n\r\nPsalms 81:1\r\n1 Sing for joy to God our strength; shout aloud to the God of Jacob!\r\n\r\nPsalms 84:5\r\n5 Blessed are those whose strength is in you, whose hearts are set on pilgrimage.\r\n\r\nPsalms 84:7\r\n7 They go from strength to strength, till each appears before God in Zion.\r\n\r\nPsalm 84\r\n9Look on our shield, O God;\r\nlook with favor on your anointed one.\r\n\r\n11For the Lord God is a sun and shield;\r\nthe Lord bestows favor and honor;\r\nno good thing does he withhold\r\nfrom those whose walk is blameless.\r\n\r\nPsalms 86:16\r\n16 Turn to me and have mercy on me; show your strength in behalf of your servant; save me, because I serve you just as my mother did.\r\n17Give me a sign of your goodness, that my enemies may see it and be put to shame,\r\nfor you, Lord, have helped me and comforted me.\r\n\r\nPsalms 88:4\r\n4 I am counted among those who go down to the pit; I am like one without strength.\r\n\r\nPsalms 89:17\r\n17 For you are their glory and strength, and by your favor you exalt our horn.\r\n\r\nPsalms 89:19\r\n19 Once you spoke in a vision, to your faithful people you said: “I have bestowed strength on a warrior; I have raised up a young man from among the people.\r\n\r\nPsalms 90:10\r\n10 Our days may come to seventy years, or eighty, if our strength endures; yet the best of them are but trouble and sorrow, for they quickly pass, and we fly away.\r\n\r\nPsalms 93:1\r\n1 The LORD reigns, he is robed in majesty; the LORD is robed in majesty and armed with strength; indeed, the world is established, firm and secure.\r\n\r\nPsalms 96:6\r\n6 Splendor and majesty are before him; strength and glory are in his sanctuary.\r\n7 Ascribe to the LORD, all you families of nations, ascribe to the LORD glory and strength.\r\n8Ascribe to the Lord the glory due his name; bring an offering and come into his courts.\r\n\r\nPsalm 118\r\n7The Lord is with me; he is my helper.\r\nI look in triumph on my enemies.\r\n\r\n13I was pushed back and about to fall,\r\nbut the Lord helped me.\r\n14The Lord is my strength and my defense;\r\nhe has become my salvation.\r\n\r\nPsalms 102:23\r\n23 In the course of my life he broke my strength; he cut short my days.\r\n\r\nPsalms 105:4\r\n4 Look to the LORD and his strength; seek his face always.\r\n\r\nPsalms 118:14\r\n14 The LORD is my strength and my defense ; he has become my salvation.\r\n\r\nPsalms 147:10\r\n10 His pleasure is not in the strength of the horse, nor his delight in the legs of the warrior;\r\n\r\nExodus 15:2\r\n2 “The LORD is my strength and my defense ; he has become my salvation. He is my God, and I will praise him, my father’s God, and I will exalt him.\r\n\r\nExodus 15:13\r\n13 In your unfailing love you will lead the people you have redeemed. In your strength you will guide them to your holy dwelling.\r\n\r\nProverbs 14:4\r\n4 Where there are no oxen, the manger is empty, but from the strength of an ox come abundant harvests.\r\n\r\nProverbs 20:29\r\n29 The glory of young men is their strength, gray hair the splendor of the old.\r\n\r\nProverbs 24:5\r\n5 The wise prevail through great power, and those who have knowledge muster their strength.\r\n\r\nProverbs 24:10\r\n10 If you falter in a time of trouble, how small is your strength!\r\n\r\nProverbs 30:25\r\n25 Ants are creatures of little strength, yet they store up their food in the summer;\r\n\r\nProverbs 31:3\r\n3 Do not spend your strength on women, your vigor on those who ruin kings.\r\n\r\nProverbs 31:25\r\n25 She is clothed with strength and dignity; she can laugh at the days to come.\r\n\r\nJob 6:11\r\n11 “What strength do I have, that I should still hope? What prospects, that I should be patient?\r\n\r\nJob 6:12\r\n12 Do I have the strength of stone? Is my flesh bronze?\r\n\r\nJob 9:19\r\n19 If it is a matter of strength, he is mighty! And if it is a matter of justice, who can challenge him ?\r\n\r\nJob 12:16\r\n16 To him belong strength and insight; both deceived and deceiver are his.\r\n\r\nJudges 16:6\r\n6 So Delilah said to Samson, “Tell me the secret of your great strength and how you can be tied up and subdued.”\r\n\r\nJob 22:9\r\n9 And you sent widows away empty-handed and broke the strength of the fatherless.\r\n\r\nJob 30:2\r\n2 Of what use was the strength of their hands to me, since their vigor had gone from them?\r\n\r\nJob 39:11\r\n11 Will you rely on it for its great strength? Will you leave your heavy work to it?\r\n\r\nJob 39:19\r\n19 “Do you give the horse its strength or clothe its neck with a flowing mane?", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.553894}
{"cid": "UgzrGmu51N_uIHiVFG94AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 18\r\nFor it is written\r\nJob 39:21\r\n21 It paws fiercely, rejoicing in its strength, and charges into the fray.\r\n\r\nJob 40:16\r\n16 What strength it has in its loins, what power in the muscles of its belly!\r\n\r\nJob 41:12\r\n12 “I will not fail to speak of Leviathan’s limbs, its strength and its graceful form.\r\n\r\nJob 41:22\r\n22 Strength resides in its neck; dismay goes before it.\r\n\r\n1 Samuel 2:4\r\n4 “The bows of the warriors are broken, but those who stumbled are armed with strength.\r\n\r\n1 Samuel 2:9\r\n9 He will guard the feet of his faithful servants, but the wicked will be silenced in the place of darkness. “It is not by strength that one prevails;\r\n\r\n1 Samuel 2:10\r\n10 those who oppose the LORD will be broken. The Most High will thunder from heaven; the LORD will judge the ends of the earth. “He will give strength to his king and exalt the horn of his anointed.”\r\n\r\n1 Samuel 2:31\r\n31 The time is coming when I will cut short your strength and the strength of your priestly house, so that no one in it will reach old age,\r\n\r\n1 Samuel 2:33\r\n33 Every one of you that I do not cut off from serving at my altar I will spare only to destroy your sight and sap your strength, and all your descendants will die in the prime of life.\r\n\r\n1 Samuel 23:16\r\n16 And Saul’s son Jonathan went to David at Horesh and helped him find strength in God.\r\n\r\n1 Samuel 28:20\r\n20 Immediately Saul fell full length on the ground, filled with fear because of Samuel’s words. His strength was gone, for he had eaten nothing all that day and all that night.\r\n\r\n1 Samuel 28:22\r\n22 Now please listen to your servant and let me give you some food so you may eat and have the strength to go on your way.”\r\n\r\n1 Samuel 30:4\r\n4 So David and his men wept aloud until they had no strength left to weep.\r\n\r\n1 Samuel 30:6\r\n6 David was greatly distressed because the men were talking of stoning him; each one was bitter in spirit because of his sons and daughters. But David found strength in the LORD his God.\r\n\r\n2 Samuel 15:12\r\n12 While Absalom was offering sacrifices, he also sent for Ahithophel the Gilonite, David’s counselor, to come from Giloh, his hometown. And so the conspiracy gained strength, and Absalom’s following kept on increasing.\r\n\r\n2 Samuel 22:33\r\n33 It is God who arms me with strength and keeps my way secure.\r\n\r\n2 Samuel 22:40\r\n40 You armed me with strength for battle; you humbled my adversaries before me.\r\n\r\nJudges 5:31\r\n31 “So may all your enemies perish, LORD! But may all who love you be like the sun when it rises in its strength.” Then the land had peace forty years.\r\n\r\nJudges 6:14\r\n14 The LORD turned to him and said, “Go in the strength you have and save Israel out of Midian’s hand. Am I not sending you?”\r\n\r\nJudges 7:2\r\n2 The LORD said to Gideon, “You have too many men. I cannot deliver Midian into their hands, or Israel would boast against me, ‘My own strength has saved me.’\r\n\r\nJudges 8:21\r\n21 Zebah and Zalmunna said, “Come, do it yourself. ‘As is the man, so is his strength.’ ” So Gideon stepped forward and killed them, and took the ornaments off their camels’ necks.\r\n\r\nJudges 15:19\r\n19 Then God opened up the hollow place in Lehi, and water came out of it. When Samson drank, his strength returned and he revived. So the spring was called En Hakkore, and it is still there in Lehi.\r\n\r\nJudges 16:5\r\n5 The rulers of the Philistines went to her and said, “See if you can lure him into showing you the secret of his great strength and how we can overpower him so we may tie him up and subdue him. Each one of us will give you eleven hundred shekels of silver.”\r\n\r\nJudges 16:9\r\n9 With men hidden in the room, she called to him, “Samson, the Philistines are upon you!” But he snapped the bowstrings as easily as a piece of string snaps when it comes close to a flame. So the secret of his strength was not discovered.\r\n\r\nJudges 16:15\r\n15 Then she said to him, “How can you say, ‘I love you,’ when you won’t confide in me? This is the third time you have made a fool of me and haven’t told me the secret of your great strength.”\r\n\r\nJudges 16:17\r\n17 So he told her everything. “No razor has ever been used on my head,” he said, “because I have been a Nazirite dedicated to God from my mother’s womb. If my head were shaved, my strength would leave me, and I would become as weak as any other man.”\r\n\r\nJudges 16:19\r\n19 After putting him to sleep on her lap, she called for someone to shave off the seven braids of his hair, and so began to subdue him. And his strength left him.\r\n\r\nDaniel 2:41\r\n41 Just as you saw that the feet and toes were partly of baked clay and partly of iron, so this will be a divided kingdom; yet it will have some of the strength of iron in it, even as you saw iron mixed with clay.\r\n\r\nDaniel 10:8\r\n8 So I was left alone, gazing at this great vision; I had no strength left, my face turned deathly pale and I was helpless.\r\n\r\nDaniel 10:17\r\n17 How can I, your servant, talk with you, my lord? My strength is gone and I can hardly breathe.”\r\n18 Again the one who looked like a man touched me and gave me strength.\r\n\r\nDaniel 10:19\r\n19 “Do not be afraid, you who are highly esteemed,” he said. “Peace! Be strong now; be strong.” When he spoke to me, I was strengthened and said, “Speak, my lord, since you have given me strength.”\r\n\r\nDaniel 11:15\r\n15 Then the king of the North will come and build up siege ramps and will capture a fortified city. The forces of the South will be powerless to resist; even their best troops will not have the strength to stand.\r\n\r\nDaniel 11:25\r\n25 “With a large army he will stir up his strength and courage against the king of the South. The king of the South will wage war with a large and very powerful army, but he will not be able to stand because of the plots devised against him.\r\n\r\nDeuteronomy 4:37\r\n37 Because he loved your ancestors and chose their descendants after them, he brought you out of Egypt by his Presence and his great strength,\r\n\r\nDeuteronomy 6:5\r\n5 Love the LORD your God with all your heart and with all your soul and with all your strength.\r\n\r\nDeuteronomy 8:17\r\n17 You may say to yourself, “My power and the strength of my hands have produced this wealth for me.”\r\n\r\nDeuteronomy 11:8\r\n8 Observe therefore all the commands I am giving you today, so that you may have the strength to go in and take over the land that you are crossing the Jordan to possess,\r\nDeuteronomy 21:17\r\n17 He must acknowledge the son of his unloved wife as the firstborn by giving him a double share of all he has. That son is the first sign of his father’s strength. The right of the firstborn belongs to him.\r\n\r\nDeuteronomy 32:36\r\n36 The LORD will vindicate his people and relent concerning his servants when he sees their strength is gone and no one is left, slave or free.\r\n\r\nDeuteronomy 33:25\r\n25 The bolts of your gates will be iron and bronze, and your strength will equal your days.\r\n\r\nDeuteronomy 34:7\r\n7 Moses was a hundred and twenty years old when he died, yet his eyes were not weak nor his strength gone.\r\n\r\nNehemiah 1:10\r\n10 “They are your servants and your people, whom you redeemed by your great strength and your mighty hand.\r\n\r\nNehemiah 4:10\r\n10 Meanwhile, the people in Judah said, “The strength of the laborers is giving out, and there is so much rubble that we cannot rebuild the wall.”\r\n\r\nNehemiah 8:10\r\n10 Nehemiah said, “Go and enjoy choice food and sweet drinks, and send some to those who have nothing prepared. This day is holy to our Lord. Do not grieve, for the joy of the LORD is your strength.”", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.555424}
{"cid": "UgxdrU7Fyr17sgaj9xV4AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! Part 19\r\nFor it is written\r\nIsaiah 10:13\r\n13 For he says: “ ‘By the strength of my hand I have done this, and by my wisdom, because I have understanding. I removed the boundaries of nations, I plundered their treasures; like a mighty one I subdued their kings.\r\n\r\nIsaiah 12:2\r\n2 Surely God is my salvation; I will trust and not be afraid. The LORD, the LORD himself, is my strength and my defense ; he has become my salvation.”\r\n\r\nIsaiah 28:6\r\n6 He will be a spirit of justice to the one who sits in judgment, a source of strength to those who turn back the battle at the gate.\r\n\r\nIsaiah 30:15\r\n15 This is what the Sovereign LORD, the Holy One of Israel, says: “In repentance and rest is your salvation, in quietness and trust is your strength, but you would have none of it.\r\n\r\nIsaiah 31:1\r\n1 Woe to those who go down to Egypt for help, who rely on horses, who trust in the multitude of their chariots and in the great strength of their horsemen, but do not look to the Holy One of Israel, or seek help from the LORD.\r\n\r\nIsaiah 33:2\r\n2 LORD, be gracious to us; we long for you. Be our strength every morning, our salvation in time of distress.\r\n\r\nIsaiah 37:3\r\n3 They told him, “This is what Hezekiah says: This day is a day of distress and rebuke and disgrace, as when children come to the moment of birth and there is no strength to deliver them.\r\n\r\nIsaiah 40:26\r\n26 Lift up your eyes and look to the heavens: Who created all these? He who brings out the starry host one by one and calls forth each of them by name. Because of his great power and mighty strength, not one of them is missing.\r\n\r\nIsaiah 40:29\r\n29 He gives strength to the weary and increases the power of the weak.\r\n\r\nIsaiah 40:31\r\n31 but those who hope in the LORD will renew their strength. They will soar on wings like eagles; they will run and not grow weary, they will walk and not be faint.\r\n\r\nIsaiah 41:1\r\n1 “Be silent before me, you islands! Let the nations renew their strength! Let them come forward and speak; let us meet together at the place of judgment\r\n\r\nIsaiah 44:12\r\n12 The blacksmith takes a tool and works with it in the coals; he shapes an idol with hammers, he forges it with the might of his arm. He gets hungry and loses his strength; he drinks no water and grows faint.\r\n\r\nIsaiah 45:24\r\n24 They will say of me, ‘In the LORD alone are deliverance and strength.’ ” All who have raged against him will come to him and be put to shame.\r\n\r\nIsaiah 49:5\r\n5 And now the LORD says— he who formed me in the womb to be his servant to bring Jacob back to him and gather Israel to himself, for I am honored in the eyes of the LORD and my God has been my strength—\r\n\r\nIsaiah 50:2\r\n2 When I came, why was there no one? When I called, why was there no one to answer? Was my arm too short to deliver you? Do I lack the strength to rescue you? By a mere rebuke I dry up the sea, I turn rivers into a desert; their fish rot for lack of water and die of thirst.\r\n\r\nIsaiah 51:9\r\n9 Awake, awake, arm of the LORD, clothe yourself with strength! Awake, as in days gone by, as in generations of old. Was it not you who cut Rahab to pieces, who pierced that monster through?\r\n\r\nIsaiah 52:1\r\n1 Awake, awake, Zion, clothe yourself with strength! Put on your garments of splendor, Jerusalem, the holy city. The uncircumcised and defiled will not enter you again.\r\n\r\nIsaiah 57:10\r\n10 You wearied yourself by such going about, but you would not say, ‘It is hopeless.’ You found renewal of your strength, and so you did not faint.\r\n\r\nIsaiah 63:1\r\n1 Who is this coming from Edom, from Bozrah, with his garments stained crimson? Who is this, robed in splendor, striding forward in the greatness of his strength? “It is I, proclaiming victory, mighty to save.”\r\n\r\n\r\nJeremiah 9:23\r\n23 This is what the LORD says: “Let not the wise boast of their wisdom or the strong boast of their strength or the rich boast of their riches,\r\n\r\nJeremiah 16:19\r\n19 LORD, my strength and my fortress, my refuge in time of distress, to you the nations will come from the ends of the earth and say, “Our ancestors possessed nothing but false gods, worthless idols that did them no good.\r\n\r\nJeremiah 17:5\r\n5 This is what the LORD says: “Cursed is the one who trusts in man, who draws strength from mere flesh and whose heart turns away from the LORD.\r\n\r\nJeremiah 51:30\r\n30 Babylon’s warriors have stopped fighting; they remain in their strongholds. Their strength is exhausted; they have become weaklings. Her dwellings are set on fire; the bars of her gates are broken.\r\n\r\nEzekiel 33:28\r\n28 I will make the land a desolate waste, and her proud strength will come to an end, and the mountains of Israel will become desolate so that no one will cross them.\r\n\r\nEzekiel 30:6\r\n6 “ ‘This is what the LORD says: “ ‘The allies of Egypt will fall and her proud strength will fail. From Migdol to Aswan they will fall by the sword within her, declares the Sovereign LORD.\r\n\r\nEzekiel 30:18\r\n18 Dark will be the day at Tahpanhes when I break the yoke of Egypt; there her proud strength will come to an end. She will be covered with clouds, and her villages will go into captivity.\r\n\r\nEcclesiastes 9:16\r\n16 So I said, “Wisdom is better than strength.” But the poor man’s wisdom is despised, and his words are no longer heeded.\r\n\r\nEcclesiastes 10:10\r\n10 If the ax is dull and its edge unsharpened, more strength is needed, but skill will bring success.\r\n\r\nEphesians 1:19\r\n19 and his incomparably great power for us who believe. That power is the same as the mighty strength\r\n\r\n1 Timothy 1:12\r\n12 I thank Christ Jesus our Lord, who has given me strength, that he considered me trustworthy, appointing me to his service.\r\n\r\n2 Timothy 4:17\r\n17 But the Lord stood at my side and gave me strength, so that through me the message might be fully proclaimed and all the Gentiles might hear it. And I was delivered from the lion’s mouth.\r\n\r\nLamentations 1:14\r\n14 “My sins have been bound into a yoke ; by his hands they were woven together. They have been hung on my neck, and the Lord has sapped my strength. He has given me into the hands of those I cannot withstand.\r\n\r\nLeviticus 26:16\r\n16 then I will do this to you: I will bring on you sudden terror, wasting diseases and fever that will destroy your sight and sap your strength. You will plant seed in vain, because your enemies will eat it.\r\n\r\nLeviticus 26:20\r\n20 Your strength will be spent in vain, because your soil will not yield its crops, nor will the trees of your land yield their fruit.\r\n\r\nJude 1:8\r\n8 In the very same way, on the strength of their dreams these ungodly people pollute their own bodies, reject authority and heap abuse on celestial beings.\r\n\r\nHebrews 11:34\r\n34 quenched the fury of the flames, and escaped the edge of the sword; whose weakness was turned to strength; and who became powerful in battle and routed foreign armies.\r\n\r\nLuke 10:27\r\n27 He answered, “ ‘Love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind’ ; and, ‘Love your neighbor as yourself.’ ”\r\n\r\nMicah 5:4\r\n4 He will stand and shepherd his flock in the strength of the LORD, in the majesty of the name of the LORD his God. And they will live securely, for then his greatness will reach to the ends of the earth.\r\n\r\n2 Kings 19:3\r\n3 They told him, “This is what Hezekiah says: This day is a day of distress and rebuke and disgrace, as when children come to the moment of birth and there is no strength to deliver them.\r\n\r\n2 Kings 23:25\r\n25 Neither before nor after Josiah was there a king like him who turned to the LORD as he did—with all his heart and with all his soul and with all his strength, in accordance with all the Law of Moses.\r\n\r\n1 Peter 4:11\r\n11 If anyone speaks, they should do so as one who speaks the very words of God. If anyone serves, they should do so with the strength God provides, so that in all things God may be praised through Jesus Christ. To him be the glory and the power for ever and ever. Amen.\r\n\r\nPhilippians 4:13\r\n13 I can do all this through him who gives me strength.\r\n\r\nRevelation 3:8\r\n8 I know your deeds. See, I have placed before you an open door that no one can shut. I know that you have little strength, yet you have kept my word and have not denied my name.\r\n\r\nRevelation 5:12\r\n12 In a loud voice they were saying: “Worthy is the Lamb, who was slain, to receive power and wealth and wisdom and strength and honor and glory and praise!”\r\n\r\nDaniel 6\r\n26“I issue a decree that in every part of my kingdom people must fear and reverence the God of Daniel.\r\n“For he is the living God\r\nand he endures forever;\r\nhis kingdom will not be destroyed,\r\nhis dominion will never end.\r\n27He rescues and he saves;\r\nhe performs signs and wonders\r\nin the heavens and on the earth.\r\nHe has rescued Daniel\r\nfrom the power of the lions.”\r\n\r\nActs 2\r\n38Peter replied, “Repent and be baptized, every one of you, in the name of Jesus Christ for the forgiveness of your sins. And you will receive the gift of the Holy Spirit. \r\n39The promise is for you and your children and for all who are far off—for all whom the Lord our God will call.”\r\n\r\nProverbs 3:5-6\r\n 5 Trust in the LORD with all your heart and lean not on your own understanding;\r\n6 in all your ways submit to him, and he will make your paths straight.\r\n\r\nJohn 8:32\r\n 32 Then you will know the truth, and the truth will set you free.”\r\n\r\n1 Timothy 1:15\r\n15 Here is a trustworthy saying that deserves full acceptance: Christ Jesus came into the world to save sinners—of whom I am the worst.\r\n\r\n1 Timothy 4:9\r\n 9 This is a trustworthy saying that deserves full acceptance.", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.55692}
{"cid": "Ugyq-ccaWI_KXYBo34l4AaABAg", "text": "Repent to JESUS CHRIST as your Lord and Savior!!!!!!! \r\nFor it is written\r\nPsalm 3\r\n6I hate those who cling to worthless idols;\r\nas for me, I trust in the Lord.\r\n\r\n14But I trust in you, Lord;\r\nI say, “You are my God.”\r\n\r\nProverbs 3:5\r\n5 Trust in the LORD with all your heart and lean not on your own understanding;\r\n6 in all your ways submit to him, and he will make your paths straight.\r\n\r\nPsalms 4:5\r\n5 Offer the sacrifices of the righteous and trust in the LORD.\r\n\r\nPsalms 20:7\r\n7 Some trust in chariots and some in horses, but we trust in the name of the LORD our God.\r\n\r\nPsalm 21\r\n7For the king trusts in the Lord;\r\nthrough the unfailing love of the Most High\r\nhe will not be shaken.\r\n\r\nPsalms 25\r\nOf David.\r\n1In you, Lord my God,\r\nI put my trust.\r\n2I trust in you;\r\ndo not let me be put to shame,\r\nnor let my enemies triumph over me.\r\n3No one who hopes in you\r\nwill ever be put to shame,\r\nbut shame will come on those\r\nwho are treacherous without cause.\r\n\r\n21May integrity and uprightness protect me,\r\nbecause my hope, Lord, is in you.\r\n\r\nPsalms 31:14\r\n14 But I trust in you, LORD; I say, “You are my God.”\r\n\r\nPsalm 33\r\n21In him our hearts rejoice,\r\nfor we trust in his holy name.\r\n22May your unfailing love be with us, Lord,\r\neven as we put our hope in you.\r\n\r\nPsalms 37\r\n Of David.\r\n1 Do not fret because of those who are evil or be envious of those who do wrong;\r\n2 for like the grass they will soon wither, like green plants they will soon die away.\r\n3 Trust in the LORD and do good; dwell in the land and enjoy safe pasture.\r\n4 Take delight in the LORD, and he will give you the desires of your heart.\r\n5 Commit your way to the LORD; trust in him and he will do this:\r\n6 He will make your righteous reward shine like the dawn, your vindication like the noonday sun.\r\n7 Be still before the LORD and wait patiently for him; do not fret when people succeed in their ways, when they carry out their wicked schemes.\r\n8 Refrain from anger and turn from wrath; do not fret—it leads only to evil.\r\n9 For those who are evil will be destroyed, but those who hope in the LORD will inherit the land.\r\n10 A little while, and the wicked will be no more; though you look for them, they will not be found.\r\n11 But the meek will inherit the land and enjoy peace and prosperity.\r\n12 The wicked plot against the righteous and gnash their teeth at them;\r\n13 but the Lord laughs at the wicked, for he knows their day is coming.\r\n14 The wicked draw the sword and bend the bow to bring down the poor and needy, to slay those whose ways are upright.\r\n15 But their swords will pierce their own hearts, and their bows will be broken.\r\n16 Better the little that the righteous have than the wealth of many wicked;\r\n17 for the power of the wicked will be broken, but the LORD upholds the righteous.\r\n18 The blameless spend their days under the LORD’s care, and their inheritance will endure forever.\r\n19 In times of disaster they will not wither; in days of famine they will enjoy plenty.\r\n20 But the wicked will perish: Though the LORD’s enemies are like the flowers of the field, they will be consumed, they will go up in smoke.\r\n21 The wicked borrow and do not repay, but the righteous give generously;\r\n22 those the LORD blesses will inherit the land, but those he curses will be destroyed.\r\n23 The LORD makes firm the steps of the one who delights in him;\r\n24 though he may stumble, he will not fall, for the LORD upholds him with his hand.\r\n25 I was young and now I am old, yet I have never seen the righteous forsaken or their children begging bread.\r\n26 They are always generous and lend freely; their children will be a blessing.\r\n27 Turn from evil and do good; then you will dwell in the land forever.\r\n28 For the LORD loves the just and will not forsake his faithful ones. Wrongdoers will be completely destroyed ; the offspring of the wicked will perish.\r\n29 The righteous will inherit the land and dwell in it forever.\r\n30 The mouths of the righteous utter wisdom, and their tongues speak what is just.\r\n31 The law of their God is in their hearts; their feet do not slip.\r\n32 The wicked lie in wait for the righteous, intent on putting them to death;\r\n33 but the LORD will not leave them in the power of the wicked or let them be condemned when brought to trial.\r\n34 Hope in the LORD and keep his way. He will exalt you to inherit the land; when the wicked are destroyed, you will see it.\r\n35 I have seen a wicked and ruthless man flourishing like a luxuriant native tree,\r\n36 but he soon passed away and was no more; though I looked for him, he could not be found.\r\n37 Consider the blameless, observe the upright; a future awaits those who seek peace.\r\n38 But all sinners will be destroyed; there will be no future for the wicked.\r\n39 The salvation of the righteous comes from the LORD; he is their stronghold in time of trouble.\r\n40 The LORD helps them and delivers them; he delivers them from the wicked and saves them, because they take refuge in him.\r\n\r\nPsalm 55\r\n23But you, God, will bring down the wicked\r\ninto the pit of decay; the bloodthirsty and deceitful\r\nwill not live out half their days. But as for me, I trust in you.\r\n\r\nPsalm 56\r\n4In God, whose word I praise— in God I trust and am not afraid. What can mere mortals do to me?\r\n\r\n10In God, whose word I praise,\r\nin the Lord, whose word I praise—\r\n11in God I trust and am not afraid.\r\nWhat can man do to me?\r\n\r\nPsalms 62\r\n7My salvation and my honor depend on God;\r\nhe is my mighty rock, my refuge.\r\n8Trust in him at all times, you people;\r\npour out your hearts to him,\r\nfor God is our refuge.\r\n9Surely the lowborn are but a breath,\r\nthe highborn are but a lie.\r\nIf weighed on a balance, they are nothing;\r\ntogether they are only a breath.\r\n10Do not trust in extortion\r\nor put vain hope in stolen goods;\r\nthough your riches increase,\r\ndo not set your heart on them.\r\n11One thing God has spoken,\r\ntwo things I have heard:\r\n“Power belongs to you, God,\r\n12and with you, Lord, is unfailing love”;\r\nand, “You reward everyone\r\naccording to what they have done.”\r\n\r\nPsalm 86\r\n2Guard my life, for I am faithful to you;\r\nsave your servant who trusts in you.\r\n\r\n4Bring joy to your servant, Lord,\r\nfor I put my trust in you.\r\n\r\nPsalms 91:2\r\n2 I will say of the LORD, “He is my refuge and my fortress, my God, in whom I trust.”\r\n\r\nPsalms 115:9\r\n9 All you Israelites, trust in the LORD— he is their help and shield.\r\n\r\nPsalms 115:11\r\n11 You who fear him, trust in the LORD— he is their help and shield.\r\n\r\nPsalms 118:8-9\r\n8 It is better to take refuge in the LORD than to trust in humans.\r\n9 It is better to take refuge in the LORD than to trust in princes.\r\n\r\nPsalms 125:1\r\nA song of ascents.\r\n1 Those who trust in the LORD are like Mount Zion, which cannot be shaken but endures forever.\r\n\r\nPsalms 146:3\r\n3 Do not put your trust in princes, in human beings, who cannot save.\r\n\r\nProverbs 3:5-6\r\n 5 Trust in the LORD with all your heart and lean not on your own understanding;\r\n6 in all your ways submit to him, and he will make your paths straight.\r\n\r\nProverbs 11:28\r\n28 Those who trust in their riches will fall, but the righteous will thrive like a green leaf.\r\n\r\nProverbs 28:25-26\r\n25 The greedy stir up conflict, but those who trust in the LORD will prosper.\r\n26 Those who trust in themselves are fools, but those who walk in wisdom are kept safe.\r\n\r\nIsaiah 2\r\n22Stop trusting in mere humans,\r\nwho have but a breath in their nostrils.\r\nWhy hold them in esteem?\r\n\r\nIsaiah 12:2\r\n2 Surely God is my salvation; I will trust and not be afraid. The LORD, the LORD himself, is my strength and my defense ; he has become my salvation.”\r\n\r\nIsaiah 26:4\r\n4 Trust in the LORD forever, for the LORD, the LORD himself, is the Rock eternal.\r\n\r\nIsaiah 42:17\r\n17 But those who trust in idols, who say to images, ‘You are our gods,’ will be turned back in utter shame.\r\n\r\nMicah 7\r\n5Do not trust a neighbor;\r\nput no confidence in a friend.\r\nEven with the woman who lies in your embrace\r\nguard the words of your lips.\r\n\r\nNahum 1:7\r\n7 The LORD is good, a refuge in times of trouble. He cares for those who trust in him,\r\n\r\nJeremiah 17\r\n9 The heart is deceitful above all things and beyond cure. Who can understand it?\r\n10 “I the LORD search the heart and examine the mind, to reward each person according to their conduct, according to what their deeds deserve.”\r\n\r\nRepent Declare and Accept JESUS CHRIST as you Lord and Savior!!!!!!! #RDaAJCayLaS\r\nKeep the Faith, Commandments, fear of GOD, trust JESUS only, study Bible Verses, and stop sinning!!!!!!! #ktFCfoGtJostBVass\r\nThank, and Praise JESUS CHRIST our Lord and Savior!!!!!!! \r\n#TaPJCoLaS", "time": "8 months ago", "author": "@angierodriguez7373", "channel": "UCaYY01IshDLVNUc9DAmNkGQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/L529S2_vLqWWrriufw4uBvXcUAFhz99miG8Nnd86eUggiq-ZPc_asvpgXiajC3X28OAFGedZSZA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.558443}
{"cid": "UgxFN4Uu-bToZiAfE9F4AaABAg", "text": "Amen I love god 🙂", "time": "8 months ago", "author": "@aubriefarfan8015", "channel": "UCY515kQxlUwjTTHksFOKrEw", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_m2BmIdVVhxR5IUb6bw7myCNAlClNFvAyRrvo04SZg=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.559986}
{"cid": "UgzZL7fxdCwsaewg1L14AaABAg", "text": "❤❤", "time": "8 months ago", "author": "@david_white1111", "channel": "UCNEep3QZqSK-fXOE-Dajdhg", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/7pRIV4MtOiMEEEPXrxSzNNJoJKNKxIwGdc5P9FMB6EKPa4oyClv_YZbw5DoO7GZsMKiGPj2DDlA=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.561392}
{"cid": "UgwF1_PaQaopYnHzWw54AaABAg", "text": "Do you not want to go to therapy because you still feel misunderstood? Mental health is a massive challenge and everyone suffers differently. But have you been struggling more lately? My channel offers additional mental health support. I value you and your mental health ❤❤❤", "time": "8 months ago", "author": "@xandria_positivecoaching", "channel": "UCdL9Rh81hOC1ocDvkoIPXMQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/DWci1ZcsXxJevg8KvJ8NOrFmsIwOr4IZR-To7RbrFHaAUTJOR8HpUr5EglAYRAQuFyMsbKzdFaw=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.562758}
{"cid": "Ugy7Au3Wfu0ZrsiKS6Z4AaABAg", "text": "I dont care about other people feelings.", "time": "8 months ago", "author": "@johnhalbe6530", "channel": "UCutIWGxrtSc0q0gnLh-1eYw", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_k5Y7Edl6eRPuYMHdRZAM2x6szHijbqIUX5bTutqg8=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.564082}
{"cid": "Ugzj1wZ0ckUKSaouLdJ4AaABAg", "text": "Amazing ❤ God‘s word is truth, love and healing ❤❤❤. I love you, Lord ❤", "time": "8 months ago", "author": "@Marina-20-09", "channel": "UCTgqzRygzxTHCmkxNNmKniQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_mhOsVvyiOR2DKy9B1rrzX-He2qQZ1jqeEpHRZoUYxTFaBeYJh5jM0kO6i-v0IKU5wb0w=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.565448}
{"cid": "UgzSGaJU6bNmuY9xzv54AaABAg", "text": "No lies told", "time": "8 months ago", "author": "@Neoteric.1", "channel": "UCcdlAPnkAA7b9JJXvdSmuig", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/tLRDKSDIIrlD2Hdg1dtkZK0PTj4Siqvq9xGhuUw7JPMUcA9nHB901RcpALL0TFT7EpcLtD-6mw=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.566747}
{"cid": "UgzqpzKejDYhX8V0jDd4AaABAg", "text": "I am currently studying counselling! But I do agree with you. Amen 🙏 ❤", "time": "8 months ago", "author": "@DavidTemperley-lt9xb", "channel": "UCtaeKVHD7vw7hSjtEKniEjw", "votes": "4", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_n6uXwQUZQrJSqgJ6ZF2m7yPyU86vA2cV06lZe_vIJ30N0POsPL-swpaX5qoZBX-P1M2A=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487351.998699}
{"cid": "UgxwmhDxjYETKG7mGo94AaABAg", "text": "you know what's crazy to me? that your saying this, but there are millions of people who don't follow this religion, or even follow a religion at all. there are people who are depressed, and reading the Bible might help a few, but the millions of people suffering from depression might not.", "time": "8 months ago", "author": "@mig3153", "channel": "UCJlRrtcYvzx1hbUuTnw8XWg", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_m-wvAwKyNneCMdoErnw329VPrjfATdBmyawkiFTmB0Tmcb0mbPWFH98RzurWL1m0u29A=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.000514}
{"cid": "UgwDR3R1X2EFUNWGHWl4AaABAg", "text": "Whoa, AMEN!!", "time": "8 months ago", "author": "@jesusismyanthem9567", "channel": "UCsg7o2DgsZimFnAiQcbVFZQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_kI0bujepYtv_Vf0opcU8909ZFyHn4aBBgXJJgX55o0FQr8QvN_qVMjQ1kanJATLvfjqw=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.002036}
{"cid": "UgzAY_1QBnV3uin5L6l4AaABAg", "text": "Amen.  Alert: Jesus told me He is coming for His Church this Summer.. Come to Jesus Now", "time": "8 months ago", "author": "@OmegaGuy4045", "channel": "UCdHopKmY1uuqr83bhpzu-ow", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_k2j-U1hx2gQCJStFa-jkECGZa50pYXWpHLgxBfCIntw44Dm80MYPjDJG2ntcx9_FaCSw=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.00354}
{"cid": "UgxBJcBVJ97wNUxDup14AaABAg", "text": "I love that! That’s great! But I also want to add (respectfully 🫶) that as a potential psychology major, I have learned that not all therapy is for redirecting thought process. Sometimes it’s medical and people need medication. The Bible is a great way to heal your mind and change your thought process. I totally love that! Encourage that! But, at the same time, there are psychological conditions that have to be treated with something more than the Bible", "time": "8 months ago", "author": "@LadyMischief-edits", "channel": "UCi8_uYwrJROgj8iQKMXRikQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/h_ghM9GEtHFV-Hpsa0LJnWqbimZ-QSO5LwfwwzlQpm-Ex7-pJT-vDUi41W-6ikH64cOATicR=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.005074}
{"cid": "UgxoeYSoJv4vSaCFg7V4AaABAg", "text": "Amen.", "time": "8 months ago", "author": "@nevilchristian3119", "channel": "UCJn2zaMRO5_EEIdO0mil2Ww", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/ytc/AIdro_kFgGxM3aDBe2sjrvElqL8HYiQIcKxyeF6QF8z_b6y2RlZHraJr0i89ffz9uvpBtF7hrQ=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.006619}
{"cid": "UgxwsLY0rR2APTZaTud4AaABAg", "text": "Facts 🙌🏼", "time": "8 months ago", "author": "@rss1712", "channel": "UCFLg0MxvlNbp6PO63TjWjow", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/XlcPis7py875RMPZcLjuZU_wAf2H4Z8FapcdaoNlAMRuDIJ3SY1r9h9wKL9zAsIbG4PJOdNSgWQ=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.008168}
{"cid": "Ugw6HyFebboxhB-Dac54AaABAg", "text": "Love it!💗", "time": "8 months ago", "author": "@tracyencapera9401", "channel": "UCK32NZxDgTZaYHrkBepsKUw", "votes": "1", "replies": "", "photo": "https://yt3.ggpht.com/nHeiKtHjeV___75wHYev_MmZzNfM_jNQRKreRZrcKLHr6_5ptOYGTBO2xSk608bEzjkYPoeVSw=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.009782}
{"cid": "UgwOV0gqXWb3MUnBdJx4AaABAg", "text": "Preach sister 🙏🏽✝️💖", "time": "8 months ago", "author": "@AlexandreaTharkur", "channel": "UCPAmFmB4owkttbl1FhP4MpQ", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/N7pFG5sNErlbZhl5Xde36ax6Bmiy_K2vC3VwaXZFyJrp_RYqnAM5osbcznnKFOUYfnVgV3aP-T0=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.011311}
{"cid": "Ugz-CFuVc0yRha1iwLF4AaABAg", "text": "Sweetheart ok but why not both ? Some people need it . I know I did I need both .", "time": "8 months ago", "author": "@Eyekonvivi", "channel": "UCGafbdfITYJ93EdmsBTWNuw", "votes": "0", "replies": "", "photo": "https://yt3.ggpht.com/fEqXPbdkIaEL-clmfGELswdi-cwWWYnptAL0g-rRAdZwBK0GrE4Y0b6DtivbZBuLYXX14YvWgg=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.012815}
{"cid": "UgzimboXIBTJXWuZcWB4AaABAg", "text": "(Not hating on religious people) Welp im not religous so err yeah! Oh and im too broke to get a therapist LOL😭", "time": "8 months ago", "author": "@baddiesplayer3x", "channel": "UC_8NXLgCoI6IvRToMuqeXmw", "votes": "1", "replies": "", "photo": "https://yt3.ggpht.com/smHGWgY3F8dBWjD33kIoPNICAdkLp-FaKPbd272kch1TQUer2CeI4R6CFapng3YIbj-7-tPtXuo=s88-c-k-c0x00ffffff-no-rj", "heart": false, "reply": false, "time_parsed": 1750487352.014349}
